/*
 * Processing Sample Project for Moritalab in 2018
 * 2018.04.26
 *
 * ############### MISSION ################
 * 30人の学生を，5グループに分けるプログラムを作成してください．
 * 割り振られた番号を5で割った時の余りによって，班分けしてください．
 *
 * - ヒント：aをbで割った時の余りは「a % b」で表します（「%」という記号）．
 *          例) 「10 % 3」は「1」，「15 % 6」は「3」を表す．
 * 
 */


///////////////////////////////////////////////
// このプログラム全体で使用する変数を宣言する部分
///////////////////////////////////////////////
int studentNum; //学生全員の人数

///////////////////////////////////////////////
// SETUP : このプログラムの設定を書く部分
///////////////////////////////////////////////
void setup(){
  studentNum = 30; //学生全員の人数
}//setup()終わり


///////////////////////////////////////////////
// DRAW : このプログラムでの具体的な処理を書く部分
///////////////////////////////////////////////
void draw(){
}
// 今回は，draw()の代わりに，keyPressed()という特殊な関数を使ってみる


///////////////////////////////////////////////
// KEYPRESSED : キーボードが押されたときに呼び出される処理を書く部分
///////////////////////////////////////////////
void keyPressed(){
  for(int i=0; i<studentNum; i++){
    int group = 0;
    
    if(i % 5 == 0){
      group = 1;
      
    }else if(i % 5 == 1){
      group = 2;
      
    }else if(i % 5 == 2){
      group = 3;
      
    }else if(i % 5 == 3){
      group = 4;
      
    }else if(i % 5 == 4){
      group = 5;
      
    }
    println(i + "番の人は " + group + "班");
  
  }//for文終わり
  
}//keyPressed()終わり
